let numer;
numer = prompt('Будь ласка введіть число від 1 до 12','');
if (numer == 1) {alert('1-й Місяць: Січень Пора року: Зима');}
else if (numer == 2) {alert('2-й Місяць: Лютий Пора року: Зима');}
else if (numer == 3) {alert('3-й Місяць: Березень Пора року: Весна');}
else if (numer == 4) {alert('4-й Місяць: Квітень Пора року: Весна');}
else if (numer == 5) {alert('5-й Місяць: Травень Пора року: Весна');}
else if (numer == 6) {alert('6-й Місяць: Червень Пора року: Літо');}
else if (numer == 7) {alert('7-й Місяць: Липень Пора року: Літо');}
else if (numer == 8) {alert('8-й Місяць: Серпень Пора року: Літо');}
else if (numer == 9) {alert('9-й Місяць: Вересень Пора року: Осінь');}
else if (numer == 10) {alert('10-й Місяць: Жовтень Пора року: Осінь');}
else if (numer == 11) {alert('11-й Місяць: Листопад Пора року: Осінь');}
else if (numer == 12) {alert('12-й Місяць: Грудень Пора року: Зима');}
else if (numer == null){alert('Ви не ввели число');}
else alert('Виконати операцію неможливо');